#ifndef DUSTGAME_CONST_H_INCLUDED
#define DUSTGAME_CONST_H_INCLUDED
/** \brief 存放dustGame需要用到的常量以及枚举变量类型的定义
 *
 * \param
 * \param
 * \return
 *
 */

const int MAP_LEN=10;
enum MAP_BLOCK
{
    B_BLANK,B_WALL,B_WATER,B_TREE,B_TRIGGER,B_TP_DOOR
};
int test_map[MAP_LEN][MAP_LEN]=
{
    {0      ,0      ,0      ,1      ,1      ,1      ,1      ,1      ,1      ,1      },
    {1      ,1      ,0      ,1      ,1      ,1      ,1      ,1      ,1      ,1      },
    {1      ,1      ,0      ,1      ,1      ,1      ,1      ,1      ,1      ,1      },
    {1      ,1      ,0      ,1      ,1      ,1      ,1      ,1      ,1      ,1      },
    {1      ,1      ,0      ,1      ,1      ,1      ,1      ,1      ,1      ,1      },
    {1      ,1      ,0      ,1      ,1      ,1      ,1      ,1      ,1      ,1      },
    {1      ,1      ,0      ,1      ,1      ,1      ,1      ,1      ,1      ,1      },
    {1      ,1      ,0      ,1      ,1      ,1      ,1      ,1      ,1      ,1      },
    {1      ,1      ,0      ,1      ,1      ,1      ,1      ,1      ,1      ,1      },
    {1      ,1      ,B_TP_DOOR     ,1      ,1      ,1      ,1      ,1      ,1      ,1      },

};
int test_map2[MAP_LEN][MAP_LEN]=
{
    {0      ,0      ,0      ,1      ,1      ,1      ,1      ,1      ,1      ,1      },
    {1      ,1      ,0      ,0      ,0      ,0      ,1      ,1      ,1      ,1      },
    {1      ,1      ,0      ,1      ,1      ,1      ,1      ,1      ,1      ,1      },
    {1      ,1      ,0      ,1      ,1      ,1      ,1      ,1      ,1      ,1      },
    {1      ,1      ,0      ,1      ,1      ,1      ,1      ,1      ,1      ,1      },
    {1      ,1      ,0      ,1      ,1      ,1      ,1      ,1      ,1      ,1      },
    {1      ,1      ,0      ,1      ,1      ,1      ,1      ,1      ,1      ,1      },
    {1      ,1      ,0      ,1      ,1      ,1      ,1      ,1      ,1      ,1      },
    {1      ,1      ,0      ,1      ,1      ,1      ,1      ,1      ,1      ,1      },
    {1      ,1      ,0      ,1      ,1      ,1      ,1      ,1      ,1      ,1      },

};
#endif // DUSTGAME_CONST_H_INCLUDED
